FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрайсЛистыКонтрагентовПравилаЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовПравилаЗагрузки</Name>
			<Comment>Журнал правил загрузки прайс-листов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПравила</Name>
					<Comment>Вид правила</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизитаПрайсЛиста</Name>
					<Comment>Имя реквизита прайс-листа, подлежащего обработке по правилу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Присваиваемое реквизиту значение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокПрименения</Name>
					<Comment>Последовательность применения правил загрузки (В пределах “Объекта правила”)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОригинальное</Name>
					<Comment>Начальное значение реквизита до изменений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеПравила</Name>
					<Comment>Назначение правила загрузки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПравила</Name>
					<Comment>Строка производителя, производитель или ключ строки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Comment>Идентификатор правила</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрайсЛистыКонтрагентовВременный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовВременный</Name>
			<Comment>Служит для загрузки и черновой обработки прайс-листов контрагентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции в валюте прайслиста</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючСтрокиПоставщика</Name>
					<Comment>Код, ключ строки поставщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТегПозиции</Name>
					<Comment>Тег позиции (группа скидки и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта цены в прайс-листе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМинимальный</Name>
					<Comment>Минимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставкиМаксимальный</Name>
					<Comment>Максимальный срок поставки до склада поставщика (в секундах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Представление срока поставки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес позиции прайс-листа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроизводительВПрайсЛисте</Name>
					<Comment>Производитель, как он указан в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулВПрайсЛисте</Name>
					<Comment>Артикул, как он указан в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВПрайсЛисте</Name>
					<Comment>Количество, как оно указано в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставкиВПрайсЛисте</Name>
					<Comment>Срока поставки, как он указан в прайс-листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстальныеПоляВПрайсЛисте</Name>
					<Comment>Остальные поля строки файла прайс-листа</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗагрузки</Name>
					<Comment>Признак строки, которую не нужно загружать в основной прайс-лист</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДубли</Name>
					<Comment>Для данной позиции есть дубли по ключевым полям</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Преобразованный артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата создания записи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПредложения</Name>
					<Comment>Порядковый номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыПравилЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПравилЗагрузки</Name>
			<Comment>Виды правил загрузки прайс-листов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗагружать</Name>
					<Comment>Записи по данному виду правил не будут загружаться в программу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоитьЗначение</Name>
					<Comment>Приоить значение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/НазначениеПравилЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазначениеПравилЗагрузки</Name>
			<Comment>Назначение правил загрузки прайс-листов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлючСтроки</Name>
					<Comment>По ключу строки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводительВПрайсЛисте</Name>
					<Comment>По производителю в прайс-листе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
					<Comment>По производителю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрайсЛистыКонтрагентовПравилаЗагрузки/Ext/ManagerModule.bsl
// Создаем правило загрузки для прайс-листа
// НазначениеПравила:	1 - Ключ строки
//						2 - Производитель в прайс-листе
//						3 - Производитель
// ОбъектПравила - Производитель или Строка в зависимости от назначения
// ИдентификаторПравила - Строка - уникальный идентификатор правила (если задано, то редактируем существующее правило, если нет, то создаем новое или ищем по остальным параметрам)
// ВидПравила:			1 - Не загружать
//						2 - Присвоить значение
// ИмяРеквизита - Имя реквизита над которым производится действие
// Значение - Номенклатура, Производитель, Валюта, Булево, Число, Строка, Массив
// ПорядокПрименения - Число - Порядок применения правил загрузки
Функция РедактироватьПравилоЗагрузки(ПрайсЛист,
									НазначениеПравила,
									ОбъектПравила,
									ИдентификаторПравила = Неопределено,
									ВидПравила,
									ИмяРеквизитаПрайсЛиста = Неопределено,
									Значение = Неопределено,
									ЗначениеОригинальное = Неопределено,
									ПорядокПрименения = 0,
									ВыводитьСообщения = Ложь) Экспорт
	
	Если ВидПравила = Перечисления.ВидыПравилЗагрузки.ПрисвоитьЗначение
		И НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.КлючСтроки
		И обЗначениеНеЗаполнено(ИмяРеквизитаПрайсЛиста) Тогда
		// Не должно быть такого сочетания
		Возврат Ложь;
	КонецЕсли;
	
	Если ВидПравила = Перечисления.ВидыПравилЗагрузки.НеЗагружать
		И НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.КлючСтроки Тогда
		// Не должно быть такого сочетания
		// У нас есть ЗапретЗагрузки как реквизит строки идет
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист",         ПрайсЛист);
	ЭлементБлокировки.УстановитьЗначение("НазначениеПравила", НазначениеПравила);
	ЭлементБлокировки.УстановитьЗначение("ОбъектПравила",     ОбъектПравила);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	Если ВидПравила = Перечисления.ВидыПравилЗагрузки.НеЗагружать Тогда
		// Это правило только для Производителей в прайс-листе !!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаЗагрузки.ИдентификаторПравила КАК ИдентификаторПравила
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
		|ГДЕ
		|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
		|	И ПравилаЗагрузки.НазначениеПравила = &НазначениеПравила
		|	И ПравилаЗагрузки.ОбъектПравила = &ОбъектПравила
		|	И ПравилаЗагрузки.ВидПравила = &ВидПравила
		|	И ПравилаЗагрузки.Значение = &Значение
		|";
		
		Запрос.УстановитьПараметр("ПрайсЛист",         ПрайсЛист);
		Запрос.УстановитьПараметр("НазначениеПравила", НазначениеПравила);
		Запрос.УстановитьПараметр("ОбъектПравила",     ОбъектПравила); // Производитель в прайс-листе
		Запрос.УстановитьПараметр("ВидПравила",        ВидПравила);
		Запрос.УстановитьПараметр("Значение",          Значение);      // Производитель
		
		Если Запрос.Выполнить().Пустой() Тогда
			Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
			Менеджер.ПрайсЛист            = ПрайсЛист;
			Менеджер.НазначениеПравила    = НазначениеПравила;
			Менеджер.ОбъектПравила        = ОбъектПравила;
			Менеджер.ИдентификаторПравила = Новый УникальныйИдентификатор;
			Менеджер.ВидПравила           = ВидПравила;
			Менеджер.Значениие            = Значение;
			Менеджер.ПорядокПрименения    = ПорядокПрименения;
			Менеджер.Записать();
		КонецЕсли;
		
	ИначеЕсли ВидПравила = Перечисления.ВидыПравилЗагрузки.ПрисвоитьЗначение Тогда
		// Устанавливаем значение для реквизита
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаЗагрузки.ИдентификаторПравила КАК ИдентификаторПравила,
		|	ПравилаЗагрузки.ЗначениеОригинальное
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
		|ГДЕ
		|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
		|	И ПравилаЗагрузки.НазначениеПравила = &НазначениеПравила
		|	И ПравилаЗагрузки.ОбъектПравила = &ОбъектПравила
		|	И ПравилаЗагрузки.ВидПравила = &ВидПравила";
		Запрос.УстановитьПараметр("ПрайсЛист",         ПрайсЛист);
		Запрос.УстановитьПараметр("НазначениеПравила", НазначениеПравила);
		Запрос.УстановитьПараметр("ОбъектПравила",     ОбъектПравила);
		Запрос.УстановитьПараметр("ВидПравила",        ВидПравила);
		
		Если НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте Тогда
			// Такое правило может быть только одно для пары ПроизводительВПрайсЛисте - Производитель
		Иначе
			// Здесь для каждого реквизита по одному правилу, кроме "Номенклатуры"
			Запрос.Текст = Запрос.Текст + " И ПравилаЗагрузки.ИмяРеквизитаПрайсЛиста = &ИмяРеквизитаПрайсЛиста";
			Запрос.УстановитьПараметр("ИмяРеквизитаПрайсЛиста", ИмяРеквизитаПрайсЛиста);
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			//Так создаем правила для номенклатуры
			//Если в качестве значения передан массив значений, то мы удалим все правила, которые
			//по данным измерениям существуют и для каждого значения массива создадим новое
			
			Пока Выборка.Следующий() Цикл
				Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
				Менеджер.ПрайсЛист = ПрайсЛист;
				Менеджер.НазначениеПравила = НазначениеПравила;
				Менеджер.ОбъектПравила = ОбъектПравила;
				Менеджер.ИдентификаторПравила = Выборка.ИдентификаторПравила;
				Менеджер.Прочитать();
				Если Менеджер.Выбран() Тогда
					Менеджер.Удалить();
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ЗначениеПравила ИЗ Значение Цикл
				Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
				Менеджер.ПрайсЛист = ПрайсЛист;
				Менеджер.НазначениеПравила = НазначениеПравила;
				Менеджер.ОбъектПравила = ОбъектПравила;
				Менеджер.ИдентификаторПравила = Новый УникальныйИдентификатор;
				Менеджер.ВидПравила = ВидПравила;
				Менеджер.ИмяРеквизитаПрайсЛиста = ИмяРеквизитаПрайсЛиста;
				Менеджер.Значение = ЗначениеПравила;
				Менеджер.ПорядокПрименения = ПорядокПрименения;
				Менеджер.Записать();
				
				Если ВыводитьСообщения Тогда
					#Если Клиент Тогда
						ТекстСообщения = НСтр("ru='Создано правило ""'") + ИмяРеквизитаПрайсЛиста + НСтр("ru='"" со значением ""'") + Строка(ЗначениеПравила) + """.";
						Сообщить(ТекстСообщения,СтатусСообщения.Обычное);
					#КонецЕсли
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Если Выборка.Количество() > 0 Тогда
				Выборка.Следующий();
				ИдентификаторПравила = Выборка.ИдентификаторПравила;
				ЗначениеОригинальное = Выборка.ЗначениеОригинальное;
				Если Выборка.Количество() > 1 Тогда
					Пока Выборка.Следующий() Цикл
						// Удалим все лишние записи
						Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
						Менеджер.ПрайсЛист = ПрайсЛист;
						Менеджер.НазначениеПравила = НазначениеПравила;
						Менеджер.ОбъектПравила = ОбъектПравила;
						Менеджер.ИдентификаторПравила = Выборка.ИдентификаторПравила;
						Менеджер.Прочитать();
						Если Менеджер.Выбран() Тогда
							Менеджер.Удалить();
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
				// Новое правило
				ИдентификаторПравила = Новый УникальныйИдентификатор;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист, Истина);
			НаборЗаписей.Отбор.НазначениеПравила.Установить(НазначениеПравила, Истина);
			НаборЗаписей.Отбор.ОбъектПравила.Установить(ОбъектПравила, Истина);
			НаборЗаписей.Отбор.ИдентификаторПравила.Установить(ИдентификаторПравила, Истина);
			НаборЗаписей.Прочитать();
			
			
			Если НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте Тогда
				НаборЗаписей.Очистить();
				СтрокаНабора = НаборЗаписей.Добавить();
				СтрокаНабора.ПрайсЛист = ПрайсЛист;
				СтрокаНабора.НазначениеПравила = НазначениеПравила;
				СтрокаНабора.ОбъектПравила = ОбъектПравила;
				СтрокаНабора.ИдентификаторПравила = ИдентификаторПравила;
				СтрокаНабора.ВидПравила = ВидПравила;
				СтрокаНабора.ИмяРеквизитаПрайсЛиста = "Производитель"; // На всякий случай
				СтрокаНабора.Значение = Значение;
				СтрокаНабора.ПорядокПрименения = ПорядокПрименения;
				
				ТекстСообщения = НСтр("ru='Обновлено правило для ""ПроизводительВПрайсЛисте"" - ""'") + ОбъектПравила + """ -> """ + Строка(Значение) + """.";
				
			Иначе
				Если ЗначениеОригинальное = Значение Тогда
					// Удалим правило, так как возвращаем оригинальное значение
					ТекстСообщения = НСтр("ru='Удалено правило ""'") + ИмяРеквизитаПрайсЛиста + """ """ + ЗначениеОригинальное + """ X """ + Строка(НаборЗаписей[0].Значение) + """.";
					
					НаборЗаписей.Очистить();
					
				Иначе
					Если НаборЗаписей.Количество() = 0 Тогда
						// Новое правило
						СтрокаНабора = НаборЗаписей.Добавить();
						СтрокаНабора.ПрайсЛист = ПрайсЛист;
						СтрокаНабора.НазначениеПравила = НазначениеПравила;
						СтрокаНабора.ОбъектПравила = ОбъектПравила;
						СтрокаНабора.ИдентификаторПравила = ИдентификаторПравила;
						
						ТекстСообщения = НСтр("ru='Создано правило ""'") + ИмяРеквизитаПрайсЛиста + """ """ + ЗначениеОригинальное + """ -> """ + Строка(Значение) + """.";
						
					Иначе
						// Обновляем правило
						СтрокаНабора = НаборЗаписей[0];
						
						ТекстСообщения = НСтр("ru='Обновлено правило ""'") + ИмяРеквизитаПрайсЛиста + """ """ + ЗначениеОригинальное + """ -> """ + Строка(Значение) + """.";
						
					КонецЕсли;
					
					СтрокаНабора.ВидПравила = ВидПравила;
					СтрокаНабора.ИмяРеквизитаПрайсЛиста = ИмяРеквизитаПрайсЛиста;
					СтрокаНабора.Значение = Значение;
					СтрокаНабора.ПорядокПрименения = ПорядокПрименения;
					СтрокаНабора.ЗначениеОригинальное = ЗначениеОригинальное;
					
				КонецЕсли;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
			Если ВыводитьСообщения Тогда
				#Если Клиент Тогда
					Сообщить(ТекстСообщения,СтатусСообщения.Обычное);
				#КонецЕсли
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

// Функция поиска производителя из прайс-листа
Функция ПолучитьПроизводителя(ПрайсЛист, ПроизводительВПрайсЛисте, СохранятьСопоставлениеДляПустыхПроизводителей = Ложь, СопоставленныеПроизводители = Неопределено) Экспорт
	
	Если ТипЗнч(ПроизводительВПрайсЛисте) = Тип("Число") Тогда
		ПроизводительВПрайсЛисте = Формат(ПроизводительВПрайсЛисте,"ЧН=0; ЧГ=0");
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ПроизводительВПрайсЛисте) Тогда
		// Вернем, то что указано в самом прайс-листе
		Возврат ПрайсЛист.Производитель;
	КонецЕсли;
	
	Если СопоставленныеПроизводители = Неопределено Тогда
		СопоставленныеПроизводители = ПолучитьТаблицуСопоставленныхПроизводителей(ПрайсЛист);
	КонецЕсли;
	
	// Сначала найдем в таблице с синонимами производителей
	НайденнаяСтрока = СопоставленныеПроизводители.Найти(ПроизводительВПрайсЛисте, "ПроизводительВПрайсЛисте");
	Если НайденнаяСтрока <> Неопределено Тогда
		Возврат НайденнаяСтрока.Производитель;
	КонецЕсли;
	
	//Поищем производителя по синонимам в справочнике производителей
	Производитель = Справочники.Номенклатура.НайтиПроизводителяПоНаименованию(ПроизводительВПрайсЛисте);
	
	//Дополним таблицу синонимов новой записью
	НоваяСтрока = СопоставленныеПроизводители.Добавить();
	НоваяСтрока.ПроизводительВПрайсЛисте = ПроизводительВПрайсЛисте;
	НоваяСтрока.Производитель = Производитель;
	
	Если НЕ Производитель.Пустая() ИЛИ СохранятьСопоставлениеДляПустыхПроизводителей Тогда
		// Создадим запись в регистр правил загрузки
		НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте;
		ВидПравила        = Перечисления.ВидыПравилЗагрузки.ПрисвоитьЗначение;
		Значение          = Производитель;
		Если НЕ РедактироватьПравилоЗагрузки(ПрайсЛист, НазначениеПравила, ПроизводительВПрайсЛисте,, ВидПравила, "Производитель", Значение, ПроизводительВПрайсЛисте,, Ложь) Тогда
			#Если Клиент Тогда
				Сообщить("Ошибка при создании правила загрузки для производителя в прайс-листе - " + ПроизводительВПрайсЛисте);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	Возврат Производитель;
КонецФункции //ПолучитьПроизводителя()

//Функция формирования синонимов для производителей
Функция ПолучитьТаблицуСопоставленныхПроизводителей(ПрайсЛист) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаЗагрузки.Значение КАК Производитель,
	|	ПравилаЗагрузки.ОбъектПравила КАК ПроизводительВПрайсЛисте
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|ГДЕ
	|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
	|	И ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте)
	|	И ПравилаЗагрузки.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	
	СопоставленныеПроизводители = Запрос.Выполнить().Выгрузить();
	СопоставленныеПроизводители.Индексы.Добавить("ПроизводительВПрайсЛисте");
	
	Возврат СопоставленныеПроизводители;
КонецФункции //СформироватьТаблицуСинонимовПроизводителей()


//Функция получает правила для ключа строки по переданным идентификаторам и применяет их для РС ПрайсЛистыКонтрагентов
Функция ПрименитьПравилаКПрайсЛистамКонтрагентов(ПрайсЛист, ИдентификаторыПравил) Экспорт 
	
	СписокЗначений = Новый СписокЗначений;
	Если ТипЗнч(ИдентификаторыПравил) = Тип("Массив") Тогда
		СписокЗначений.ЗагрузитьЗначения(ИдентификаторыПравил);
	Иначе
		СписокЗначений.Добавить(ИдентификаторыПравил);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ПравилаЗагрузки.ОбъектПравила КАК СТРОКА(32)) КАК КлючСтрокиПоставщика
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
		|ГДЕ
		|	ПравилаЗагрузки.ПрайсЛист = &ПрайсЛист
		|	И ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки)
		|	И ПравилаЗагрузки.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)
		|	И ПравилаЗагрузки.ИдентификаторПравила В(&ИдентификаторыПравил)
		|	И ПравилаЗагрузки.ИмяРеквизитаПрайсЛиста <> ""Номенклатура""";
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("ИдентификаторыПравил", СписокЗначений);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	МассивКлючСтрокиПоставщика = Результат.Выгрузить().ВыгрузитьКолонку("КлючСтрокиПоставщика");
	
	Возврат РегистрыСведений.ПрайсЛистыКонтрагентов.ОбновитьЗаписиВОсновномРегистре(ПрайсЛист,, МассивКлючСтрокиПоставщика);
	
КонецФункции //ПрименитьПравилаКПрайсЛистамКонтрагентов()

Функция ОчиститьПравилаПрайсЛиста(ПрайсЛист, НазначениеПравила = Неопределено, Идентификатор = Неопределено, ВосстановитьОригинальныеЗначения = Истина) Экспорт 
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист);
	Если НазначениеПравила <> Неопределено Тогда 
		ЭлементБлокировки.УстановитьЗначение("НазначениеПравила", НазначениеПравила);
	КонецЕсли;
	Если Идентификатор <> Неопределено Тогда 
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторПравила", Идентификатор);
	КонецЕсли;
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист, Истина);
	Если НазначениеПравила <> Неопределено Тогда
		НаборЗаписей.Отбор.НазначениеПравила.Установить(НазначениеПравила, Истина);
	КонецЕсли;
	Если Идентификатор <> Неопределено Тогда 
		НаборЗаписей.Отбор.ИдентификаторПравила.Установить(Идентификатор, Истина);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если ВосстановитьОригинальныеЗначения Тогда
		ТабПравил = НаборЗаписей.Выгрузить(, "ПрайсЛист, НазначениеПравила, ОбъектПравила, ВидПравила, ИмяРеквизитаПрайсЛиста, ЗначениеОригинальное");
	КонецЕсли;
	
	НаборЗаписей.Очистить();
	Попытка
		НаборЗаписей.Записать();
	Исключение
		#Если Клиент Тогда
			ТекстСообщения = НСтр("ru='Не удалось очистить правила загрузки: '") + ИнформацияОбОшибке();
			Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		#КонецЕсли
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если ВосстановитьОригинальныеЗначения Тогда
		//Востановим значения во временном и постоянном регистрах
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабПравил.НазначениеПравила,
		|	ТабПравил.ОбъектПравила,
		|	ТабПравил.ВидПравила,
		|	ТабПравил.ИмяРеквизитаПрайсЛиста,
		|	ТабПравил.ЗначениеОригинальное
		|ПОМЕСТИТЬ втПравила
		|ИЗ
		|	&ТабПравил КАК ТабПравил
		|ГДЕ
		|	ТабПравил.ИмяРеквизитаПрайсЛиста <> ""Номенклатура""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Временный.ПрайсЛист,
		|	Временный.ДатаЗаписи,
		|	Временный.КодПредложения,
		|	ВЫБОР
		|		КОГДА ТабПравил.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте)
		|				И ТабПравил.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)
		|			ТОГДА ""Производитель""
		|		ИНАЧЕ ТабПравил.ИмяРеквизитаПрайсЛиста
		|	КОНЕЦ КАК ИмяРеквизитаПрайсЛиста,
		|	ТабПравил.ЗначениеОригинальное,
		|	Временный.КлючСтрокиПоставщика
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПравила КАК ТабПравил
		|		ПО ((ВЫРАЗИТЬ(ТабПравил.ОбъектПравила КАК СТРОКА(32))) = Временный.КлючСтрокиПоставщика
		|					И ТабПравил.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки)
		|				ИЛИ (ВЫРАЗИТЬ(ТабПравил.ОбъектПравила КАК СТРОКА(100))) = Временный.ПроизводительВПрайсЛисте
		|					И ТабПравил.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.ПроизводительВПрайсЛисте)
		|					И ТабПравил.ВидПравила = ЗНАЧЕНИЕ(Перечисление.ВидыПравилЗагрузки.ПрисвоитьЗначение)
		|					И ТабПравил.ЗначениеОригинальное <> Временный.Производитель)
		|ГДЕ
		|	Временный.ПрайсЛист = &ПрайсЛист";
		
		Запрос.УстановитьПараметр("ТабПравил", ТабПравил);
		Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
		
		Результат = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовВременный");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Результат;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПрайсЛист", "ПрайсЛист");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДатаЗаписи", "ДатаЗаписи");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КодПредложения", "КодПредложения");
		
		МассивКлючей = Новый Массив;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивКлючей.Добавить(Выборка.КлючСтрокиПоставщика);
			
			НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовВременный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист, Истина);
			НаборЗаписей.Отбор.ДатаЗаписи.Установить(Выборка.ДатаЗаписи, Истина);
			НаборЗаписей.Отбор.КодПредложения.Установить(Выборка.КодПредложения, Истина);
			НаборЗаписей.Прочитать();
			Для Каждого СтрокаНабора Из НаборЗаписей Цикл
				СтрокаНабора[Выборка.ИмяРеквизитаПрайсЛиста] = Выборка.ЗначениеОригинальное;
				Если Выборка.ИмяРеквизитаПрайсЛиста = "Артикул" ИЛИ Выборка.ИмяРеквизитаПрайсЛиста = "Производитель" Тогда
					СтрокаНабора.АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(СтрокаНабора.Артикул, СтрокаНабора.Производитель);
				КонецЕсли;
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				#Если Клиент Тогда
					ТекстСообщения = НСтр("ru='Не удалось восстановить оригинальное значение: '") + ИнформацияОбОшибке().Описание;
					Сообщить(ТекстСообщения, СтатусСообщения.Важное);
				#КонецЕсли
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
			
		КонецЦикла;
		
		РегистрыСведений.ПрайсЛистыКонтрагентов.ОбновитьЗаписиВОсновномРегистре(ПрайсЛист,, МассивКлючей);
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции //ОчиститьПравилаПрайсЛиста()

Функция MD5(КодируемаяСтрока)
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(КодируемаяСтрока);
	ХешСумма = Строка(Хеш.ХешСумма);
	Возврат СтрЗаменить(ХешСумма," ","");
КонецФункции //MD5()

Функция ИзменитьКлючПравилЗагрузки(ПрайсЛист, НовыйНаборКлючей) Экспорт 
	
	// Сначала соберем текущие правила по временному регистру
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Временный.ПрайсЛист,
	|	Временный.КлючСтрокиПоставщика,
	|	Временный.АртикулВПрайсЛисте,
	|	Временный.ПроизводительВПрайсЛисте,
	|	Временный.Наименование,
	|	Временный.КоличествоВПрайсЛисте,
	|	Временный.СрокПоставкиВПрайсЛисте,
	|	Временный.ОстальныеПоляВПрайсЛисте,
	|	ПравилаЗагрузки.НазначениеПравила,
	|	ПравилаЗагрузки.ОбъектПравила,
	|	ПравилаЗагрузки.ИдентификаторПравила,
	|	ПравилаЗагрузки.ВидПравила,
	|	ПравилаЗагрузки.ИмяРеквизитаПрайсЛиста,
	|	ПравилаЗагрузки.Значение,
	|	ПравилаЗагрузки.ПорядокПрименения,
	|	ПравилаЗагрузки.ЗначениеОригинальное
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовВременный КАК Временный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПравилаЗагрузки
	|		ПО Временный.ПрайсЛист = ПравилаЗагрузки.ПрайсЛист
	|			И (ПравилаЗагрузки.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилЗагрузки.КлючСтроки))
	|			И ((ВЫРАЗИТЬ(ПравилаЗагрузки.ОбъектПравила КАК СТРОКА(32))) = Временный.КлючСтрокиПоставщика)
	|ГДЕ
	|	Временный.ПрайсЛист = &ПрайсЛист";
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	ТаблицаСтарыхПравил = Запрос.Выполнить().Выгрузить();
	
	// Сформируем таблицу новых правил
	ТаблицаНовыхПравил = ТаблицаСтарыхПравил.СкопироватьКолонки("ПрайсЛист, НазначениеПравила, ОбъектПравила, ИдентификаторПравила, ВидПравила, ИмяРеквизитаПрайсЛиста, Значение, ПорядокПрименения, ЗначениеОригинальное");
	Для Каждого СтароеПравило Из ТаблицаСтарыхПравил Цикл
		КлючНеЗаполнен = Истина;
		НовыйКлючСтрокиПоставщика = "";
		СписокОстальныхПолей = СтароеПравило.ОстальныеПоляВПрайсЛисте.Получить();
		Для Каждого ПолеЗагрузки Из НовыйНаборКлючей Цикл
			ЗначениеПоля = "";
			Если ПолеЗагрузки.ИмяРеквизитаПрайсЛиста = "Артикул" Тогда
				ЗначениеПоля = СтароеПравило.АртикулВПрайсЛисте;
			ИначеЕсли ПолеЗагрузки.ИмяРеквизитаПрайсЛиста = "Производитель" Тогда
				ЗначениеПоля = СтароеПравило.ПроизводительВПрайсЛисте;
			ИначеЕсли ПолеЗагрузки.ИмяРеквизитаПрайсЛиста = "Количество" Тогда
				ЗначениеПоля = СтароеПравило.КоличествоВПрайсЛисте;
			ИначеЕсли ПолеЗагрузки.ИмяРеквизитаПрайсЛиста = "СрокПоставки" Тогда
				ЗначениеПоля = СтароеПравило.СрокПоставкиВПрайсЛисте;
			ИначеЕсли ПолеЗагрузки.ИмяРеквизитаПрайсЛиста = "Наименование" Тогда
				ЗначениеПоля = СтароеПравило.Наименование;
			Иначе
				Если ТипЗнч(СписокОстальныхПолей) = Тип("СписокЗначений") Тогда
					ЭлементСписка = СписокОстальныхПолей.НайтиПоЗначению(ПолеЗагрузки.ИмяПоляФайла);
					Если ЭлементСписка <> Неопределено Тогда
						ЗначениеПоля = ЭлементСписка.Представление;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
				КлючНеЗаполнен = Ложь;
			КонецЕсли;
			НовыйКлючСтрокиПоставщика = НовыйКлючСтрокиПоставщика + "_" + ЗначениеПоля;
		КонецЦикла;
		Если КлючНеЗаполнен Тогда
			Продолжить;
		КонецЕсли;
		НовоеПравило = ТаблицаНовыхПравил.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеПравило, СтароеПравило,, "ОбъектПравила");
		НовоеПравило.ОбъектПравила = НРег(MD5(НовыйКлючСтрокиПоставщика));
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист);
	ЭлементБлокировки.УстановитьЗначение("НазначениеПравила", Перечисления.НазначениеПравилЗагрузки.КлючСтроки);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист, Истина);
	НаборЗаписей.Отбор.НазначениеПравила.Установить(Перечисления.НазначениеПравилЗагрузки.КлючСтроки, Истина);
	НаборЗаписей.Загрузить(ТаблицаНовыхПравил);
	Попытка
		НаборЗаписей.Записать();
	Исключение
		#Если Клиент Тогда
			ТекстСообщения = НСтр("ru='Не удалось обновить правила загрузки: '") + ИнформацияОбОшибке();
			Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		#КонецЕсли
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции //ОчиститьПравилаПрайсЛиста()
